/*
 ДЗ написать ШАБЛОННУЮ функцию которая меняет местами
значения 2 - х переменных с помощью ССЫЛОК.
<---------------------------------------------------------------------------------->

 Напишите функцию, меняющую местами значения переменных с помощью указателей.
<----------------------------------------------------------------------------------->

 Work: Написать программу которая генерирует случайные числа, и заполняет 
 этими числами массив. Массив 10, диапозон значений от 0 до 20.
 ЭЛЕМЕНТЫ В МАССИВЕ НЕ ДОЛЖНЫ ПОВТОРЯТЬСЯ.
<------------------------------------------------------------------------------------>

 Домашнее задание. Написать программу, которая выводит на экран прямоугольник символом *. Высота и ширина задаётся пользователем.
*/



